# StructuralBeamStartAttachmentDistance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralBeamStartAttachmentDistance Property
ParameterTypeId Class See Also
---
"Start Attachment Distance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralBeamStartAttachmentDistance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralBeamStartAttachmentDistance As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralBeamStartAttachmentDistance {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace